
&ИзменениеИКонтроль("ПередЗаписью")
Процедура ОбменERP_ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого СтрокаНабора Из ЭтотОбъект Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаНабора.Контрагент) И СтрокаНабора.Контрагент <> Неопределено Тогда
			СтрокаНабора.Контрагент = Неопределено;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаНабора.РасчетныйДокумент) И СтрокаНабора.РасчетныйДокумент <> Неопределено Тогда
			СтрокаНабора.РасчетныйДокумент = Неопределено;
		КонецЕсли;
#Вставка
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.РасчетныйДокумент) Тогда
			СтрокаНабора.РасчетныйДокумент = СтрокаНабора.Регистратор;
		КонецЕсли;
#КонецВставки

	КонецЦикла;

КонецПроцедуры
